{
    "pages": [
        {
            "text": "Elliott Hulse, a fitness coach, on the topic of\nbuilding muscles,\n\nYour muscles need to be stressed to a point where they are FORCED to grow\nbigger and stronger. Otherwise they will stay the same, seeing no need to\nwaste valuable energy on developing a bigger musculature. Something key to\nremember, for any physical goal, is that the body will always take the path of\nleast resistance. Put it in an environment where YOUR GOAL is the only\npossible outcome.\n\nTo have big muscles you have to lift heavy weights. Heavier than what you can\nlift easily. If you won’t push your body, it won’t develop. Forcing your body to\ndo the impossible is the only way to make it develop.\nWe all create a comfort zone around us. We build it, cherish it, come to rely on\nit, and then we lock ourselves in. This is true for software development too.\nYou can never improve as a developer if you cage yourself in your comfort zone.\nYou may call your specific skills as your niche. You may proclaim that the your\nprogramming language is the best and most powerful language ever created.\nFor what it’s worth, fall in love with your platform and become its ardent\nworshipper. Your call! But you cannot improve this way.\n\nCC\nimage\ncourtesy of\nPaul Reynolds\nC was the first programming language I learned. After few months, I landed on my\nfirst job where I kept developing softwares in C. For a long time I didn’t\nbother to learn how to use a debugger at all. My excuse was something along\nthese lines, “I can debug all I want using log statements thrown all around the code.”\nThis was a good enough excuse for many. But I knew, deep down, the real reason\nwas that learning a command line debugger (GDB) scared me.\nEach time I opened up a GDB tutorial, I would close the browser tab within few\nminutes. “Gosh! What is this? The lingo is so alien. What the heck writer is\nbabbling about? Argh! I will never get it.”\nI was afraid that I am facing something that I can never understand. “I have\nreached my limits. Why add another item in my list of failures? Lets just drop\nit so that I don’t have to feel so uncomfortable. My world is going just fine\nwithout GDB.”\nDon’t do what I did.\nThis approach may work for some time and in few cases. Unfortunately, this\nattitude becomes persistent and turns into a habit. It begins to reflect, not\nonly in your programming, but in every aspect of your life.\nIn the same class where I learned C, several students gave up on C. Their\nexcuse, “C is not widely used. We are more interested in learning Java or C#.\nThese will offer us better job prospects.”\nGuess what? They never came around to learn any of their favorite language.\nFirst they gave up on pointers, and then C. \nSame guys gave up on object-oriented programming introductory classes.\nWhen C# classes started they weren’t ready for it at all.\nFinally they stopped programming altogether.\nSome took up graphic designing course, and rest took up\nquality assurance. The attitude of shying away from difficult stripped\naway their dreams.\nIf you want to improve, get out of your comfort zone. Pick something that\nchallenges you.\nDo what you think you can never do in ten years, heck, in your life time.\nDo whatever that makes you uncomfortable.", 
            "tags": "Career Advice", 
            "loc": "http://oncrashreboot.com/career-advice-software-developers-fitness-coach", 
            "title": "A Fitness Coach and the Software&nbsp;Developers"
        }, 
        {
            "text": "\nElegant is a stylish, responsive, and minimal Pelican theme that looks amazing across all screen resolutions and devices. \nElegant gives meaning to the expression “sand the under side of the drawer.” Every feature and style of Elegant is the result of a long thought process. \n\nGet Elegant 1.3\nLicense Agreement|Release Notes\n  Show your support. Leave a tip! \n\nWhat makes Elegant so special? \nSearch¶\nStatic sites usually do not offer search. Elegant uses Tipue Search- an open source jQuery plugin, to offer search for your static site.\nThere are two search modes.\n\nJSON Mode Your site pages will be stored in JSON at your server. Tipue Search will use AJAX to access it and render search result. You need Tipue Search plugin to use this mode.\nLive Mode Search Tipue Search will fetch your site using Sitemap, index it and store it in the visitor’s cache. This mode requires Sitemap plugin.\n\nUse JSON mode if you value speed, or have a large site, or don’t want to overwhelm your host server for every search query.\nHere is how the search result looks like\n\nSearch box is part of main navigation menu so that visitor can search from any page.\n\nLive Filter for Tags¶\nElegant is a minimal theme. Instead of creating separate pages for each tag, Elegant shows all the tags on a single page. To help visitor find the tags he is interested in, Elegant offers live filter. \nGo to tags page and type your required tag in “Find a tag” search box. Elegant will automatically filter the list.\nFor example, this is how my tags page looks like\n\nAs soon as I type “os”, all other tags are filtered out\n\nWith live filter, your reader will have no difficulty in picking up his desired tag from the list, even if your site has hundreds of tags.\nAll Categories but with zero clutter¶\nPelican by default creates a separate page for each category. Themes list all the articles filed in that category at its page. Elegant takes a different approach. \nIt lists all the categories and their articles on the same page. To reduce clutter and utilise space efficiently, each category and its list of articles in enclosed in collapsible accordions.\nHere is how categories appear collapsed\n\nAnd this is how they appear uncollapsed\n\nDid you notice that categories are listed in ascending alphabetical order and articles are sorted by their date in descending order?\nHome Page Features¶\nThis is the page that visitors see when they open your website. Your chance to make a good and lasting first impression. Most sites just display a list of recent posts. Elegant goes the extra mile. Check this out\n\nYou can see two sections here,\n\nAbout me\nMy Projects\n\nThere is a third section below these two sections, “Recent articles”\n\nAbout me¶\nYou can write up your own About me section using LANDING_PAGE_ABOUT variable in your configuration. It is a dictionary that has two keys title and details. Value of title is displayed in the header of the home page, like in the above example it is “I design and build software products for iOS and OSX”. details is the text that appears under “About me” heading.\nProjects¶\nProjects list is read from PROJECTS. It is an array of dictionaries. Each dictionary has three keys, name which will have name of your project, url which will have URL of the project, and description which will have the description of the project. You can define as many projects as you want. Here is an example,\n1\n2\n3\n4\n5\n6\n7\n8\n9PROJECTS = [{\n    'name': 'Logpad + Duration',\n    'url': 'https://github.com/talha131/logpad-plus-duration#logpad--duration',\n    'description': 'Vim plugin to emulate Windows Notepad logging feature,'\n    ' and log duration of each entry'},\n    {'name': 'Elegant Theme for Pelican',\n    'url': 'http://oncrashreboot.com/pelican-elegant',\n    'description': 'A clean and distraction free theme, with search and a'\n    ' lot more unique features, using Jinja2 and Bootstrap'}]\n\n\nRecent Articles¶\nRecent articles show last RECENT_ARTICLES_COUNT whose default value is 10. It also has a link to “all posts”.\nMailchimp¶\nMailchimp has become the preferred newsletter service. Elegant shows a form to subscribe to your newsletter, above the fold, in the right section of every article. Increased visibility is said to increase number of subscribers.\n\nYou need to put your Mailchimp form action URL in MAILCHIMP_FORM_ACTION in your configuration file. You can also define EMAIL_SUBSCRIPTION_LABEL, EMAIL_FIELD_PLACEHOLDER and SUBSCRIBE_BUTTON_TITLE to customize user experience.\nCollapsible Comments¶\nReaders use scroll bar to track their progress when reading inside their browsers. Very often comments take up more space than the actual article. When comments take up more space, it throws the scroll bar proportion off and reader cannot judge his progress correctly. Hacker News hosted a discussion on this topic.\n\ntons of online articles list comments on the same page, so the scroll bar is almost a negative incentive to keep reading.\n“I’ve read this much of the article and I’m only 1/20th of the way down?” [user stops reading, unaware that there’s 450 comments and the article is actually pretty short]\n\nElegant keeps the comments section hidden by default. Reader can hide and unhide the section by clicking on the comments section.\nThis is how comments section appear\n\nIt expands when reader clicks on it\n\nInvite Visitors to Comment¶\nInstead of just throwing in comments’ form at the end of every article, Elegant offers you a way to write introductory text that would appear before comments. Assign your message to COMMENTS_INTRO in your configuration file.\nWrite whatever you think is appropriate to invite the visitor to comment. Be creative! You can even put a link to your twitter account or newsletter there. Here is what I have chosen to say to my visitors.\n\nArticles Count with every Tag and Category¶\nReaders of an article on your site usually look for other articles on the same topic. Categories and tags are a way of showing them related articles. Elegant displays the count of articles that you have written in a category or tag in a non-intrusive manner. \nEvery category and tag has the count of articles in superscript. So if you have written three articles in the C++ category or tag, it will have 3 in the superscript. This way visitor will know you have written other articles too on the same topic.\nCheck out the screenshots,\n\n\nCustom 404 Page¶\nElegant has a custom Error 404 page for your readers.\n\nPage Title¶\nElegant follows following format for the <title> tag\nArticle title · Site Name\n\n\nSome sites put site title first and article title later in the <title> tag. There is a problem with this approach.  When you open too many tabs, browser delimits tab’s title from the end. In such cases, only the first few words or even letters of the <title> are left visible. \nIf visitor has opened several tabs from your website, all tabs will have “Site Name…” title. User will need to click on each tab to identify his required tab from the content. But with Elegant’s approach article title will always be visible, and reader will have less difficultly in identifying the tab he is after. \nPutting site title before the article title increases your site name visibility. Elegant achieves this by putting site name in the top navigation bar of every page, where it always stays above the fold. \nNext and Previous Articles¶\nOne way to keep the visitor engaged is to show links to articles published before and after the article visitor is currently reading. Elegant shows newer article on the right hand side and older article on the left hand side at the bottom of every article. \nMost of the content on web is written in left to right languages. In these languages pages are placed from left to right. It seemed natural to use the same order in Elegant. \n\nElegant does not require any plugin to show this list.\nCode Style¶\nElegant uses Solarized theme for syntax highlighting. Line numbers have a different background color so that they appear distinct from the code. Here is an example\n1\n2\n3\n4int sample_function (void) {\n    printf (\"This is a sample function\");\n    return 0\n}\n\n\nDisqus Thread ID¶\nMost Pelican themes pass article URL to Disqus as the Disqus identifier. This puts you at a disadvantage. If you are forced to change URL of an article you will lose Disqus discussion for that article because Disqus identifier for the article will change too.\nElegant offers you disqus_identifier property that you can set in your article meta data. Set it to any unique string you want. It won’t be effected by the article URL.\nIf you choose not to use disqus_identifier, Elegant defaults to article URL and passes it on to Disqus.\nAdd License to your Site¶\nYou can put your license string in SITE_LICENSE. It will appear in the footer of every page of your site. Here is how license of my site looks like,\n\nTable of Content¶\nThe idea behind Elegant’s design is to make reading a clean and distraction free experience. Table of contents is important but it is not part of the article content. Therefore, Elegant pushes out table of content to the left of the article’s main content. Its font size is relatively smaller. This way, table of content stays visible for navigation but reader’s attention to the article stays unaffected.\nTo utilise this feature, you need to use extract_toc plugin. Elegant encloses the table of content in <nav> tag for semantics.\nArticle Subtitle¶\nPelican lets you define title of your article in the meta data. Elegant adds subtitle support. Just define subtitle in your article’s meta data and it will appear along with your title. Here is an example,\n\nArticle subtitle is displayed with the title in every list. To keep it visibly separate from title, subtitle is enclosed in <small> tag. When visible cue cannot be used, like in the title attribute of html anchor tag <a>, a hyphen is inserted between them.\n\nSite Subtitle¶\nYou can also define SITESUBTITLE, it appears in the footer, before site license.\n\nFavicon and Speed Dial icon¶\nEvery decent site has favicon, Apple launcher icons and Opera speed dial icon. Elegant supports all of them.\nPlace your images in content/theme/images directory, and define STATIC_PATHS variable in your configuration\nSTATIC_PATHS = ['theme/images', 'images']\n\nYour images should have follow these naming schemes\n\napple-touch-icon-114x114.png \napple-touch-icon-144x144.png\napple-touch-icon-57x57.png\napple-touch-icon-72x72.png\napple-touch-icon.png\nfavicon.ico\n\nI recommend using Iconifier.net to generate the set of images. \nModified Date¶\nYou will need to update your articles time and again. You can show the date article was last updated by defining modified in your article meta data. \nThis is how it is displayed in the side bar,\n\nValue of modified is treated as string, thus you can insert raw HTML in it. For example, modified meta data for this article is\nmodified: <a href=\"https://github.com/talha131/onCrashReboot/commits/master/content/Projects/elegant-theme.md\" title=\"Revision History\">Aug 29, 2013</a>\n\nClicking on “Aug 29, 2013” will take reader to the Git repository which will show him revision history of the article.\nEfficient use of Meta Tags¶\nElegant puts tags and category of your article in keywords tag <meta name=\"keywords\". You can set keywords property in an article to define your own keywords that should be included there.\nYour SITE_DESCRIPTION and article summary is used to define description tag <meta name=\"description\".\nYour AUTHOR name is used in copyright tag <meta name=\"copyright\". \nWeb Safe Fonts¶\nElegant uses commonly available typefaces in every style rule. It has a list of closely matching fonts in the fallback list. For examples Baskerville is the first choice for headings. But if reader does not have Baskerville installed, Garamond will be used. If that too fails then Georgia will be used.\n\nElegant - Technical Nitty-Gritty¶\nConfiguration Variables¶\nHere are the variables that you should set in your configuration to get the most out of Elegant\nPLUGINS = ['sitemap', 'extract_toc', 'tipue_search']\nMD_EXTENSIONS = ['codehilite(css_class=highlight)', 'extra', 'headerid', 'toc']\nDIRECT_TEMPLATES = (('index', 'tags', 'categories','archives', 'search', '404'))\nSTATIC_PATHS = ['theme/images', 'images']\nTAG_SAVE_AS = ''\nCATEGORY_SAVE_AS = ''\nAUTHOR_SAVE_AS = ''\n\nThese are the optional configuration variables that you can define\nRECENT_ARTICLES_COUNT (integer)  \nCOMMENTS_INTRO ('string')\nSITE_LICENSE ('string')\nSITE_DESCRIPTION ('string')\nEMAIL_SUBSCRIPTION_LABEL ('string')\nEMAIL_FIELD_PLACEHOLDER ('string')\nSUBSCRIBE_BUTTON_TITLE ('string')\nMAILCHIMP_FORM_ACTION ('string')\nSITESUBTITLE ('string')\nLANDING_PAGE_ABOUT ({})\nPROJECTS ([{},...])\n\nThese are the optional article meta data variables that you can use\nsubtitle\nsummary\ndisqus_identifier\nmodified\nkeywords\n\nBlog onCrash=Reboot(); uses Elegant theme. You can see its configuration files at Github for inspiration.\nLicense¶\nThe license requires that you give credit to me, Talha Mansoor, as the author of the Elegant theme on every site that uses this theme. I have placed the attribution in the footer of every page. Do not remove it. If you need to remove or change the style of the attribution, please get in touch with me first. \nAlong with this attribution clause, Elegant theme is licensed under The MIT License.\nIf you use my theme, I would love to hear from you. Get in touch and let me know about it. I may link to your site too.\nContribute¶\nFront end design is not my strong suite. I must have made some blunders in this design unknowingly. Please don’t let me go away with buggy code.   \n\nFile bugs at Github issues.  \nShare your ideas about the design in the comments below.  \nAnd most of all contribute improvements to this project.\n\nThere are two problem areas that I can think of,\n\nInternet Explorer support\nWeb safe fonts. I developed this theme on a MacBook Retina. Although I have tried to make sure it looks great on all platforms but it still needs polish\n\nBesides these, there must be other bugs that I haven’t noticed yet. I need your help to hunt them down and make them behave.", 
            "tags": "Elegant - Pelican Theme", 
            "loc": "http://oncrashreboot.com/elegant-best-pelican-theme-features", 
            "title": "Elegant"
        }, 
        {
            "text": "Mac App Store is accessed using macappstore URL scheme. Your URL should follow this pattern:\nmacappstore://itunes.apple.com/app/id[APP_ID]?mt=12\n\nReplace [APP_ID] with your app’s track id.\nHow to find Track ID of any app¶\nYou can easily get track ID from URL of the application at App Store. For example, URL of Mac App Store page for Jump Desktop is \nhttps://itunes.apple.com/ca/app/jump-desktop-remote-desktop/id524141863?mt=12\n\nNumber between id and ? is the required ID which in this case is 524141863.\nLets test it. Replace [APP_ID] with 524141863 in the macappstore:// URL given above. Then open the URL from Terminal\nopen macappstore://itunes.apple.com/app/id524141863?mt=12\n\nThis should open Mac App Store desktop application to Jump Desktop page.\nHow to open Mac App Store from inside your Application¶\nNow that we know the required URL scheme and track ID, opening iTunes page in Mac App Store is pretty simple. See the following code snippet.\n1\n2\n3\n4\n5\n6\n7\n8NSString *track_id = @\"524141863\";\nNSString *app_url_str = [NSString stringWithFormat:\n    @\"macappstore://itunes.apple.com/app/id%@?mt=12\",\n    track_id];\n// Create NSURL to pass it to NSWorkspace\nNSURL *app_url = [NSURL URLWithString:app_url_str];\n// Open URL\n[[NSWorkspace sharedWorkspace] openURL:app_url];\n\n\nYou just need to the pass openURL: message with correctly formed URL to [NSWorkspace sharedWorkspace] object.", 
            "tags": "OSX Software Development", 
            "loc": "http://oncrashreboot.com/how-to-open-mac-app-store-programmatically", 
            "title": "How to open Mac App Store&nbsp;Programmatically"
        }
    ]
}